src/Documents/СписокНаАванс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СписокНаАванс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СписокНаАванс</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторасчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/АвансыРаботникамОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АвансыРаботникамОрганизаций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CalculationRegisters/ОсновныеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДнейПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДнейПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасовПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасовПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбработкиЗаписиПриОтраженииВРеглУчете</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАлгоритмаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАлгоритмовРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыИзДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаСверхурочныхЧасов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойРасчетСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Documents/СписокНаАванс/Ext/ObjectModule.bsl
Процедура Рассчитать(ВариантРасчета, ПроцентВыплаты = 100) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамОрганизация",	 Организация);
	Запрос.УстановитьПараметр("парамСсылка",		 Ссылка);
	Запрос.УстановитьПараметр("парамДата",			 КонецМесяца(ПериодРегистрации) + 1);
	Запрос.УстановитьПараметр("ПериодДействия",		 НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодДействия1",	 КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПроцентВыплаты", ПроцентВыплаты);
	
	РасчетТарифногоОклада();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНаАвансРаботникиОрганизации.Физлицо,
	|	ВЫБОР
	|		КОГДА СписокНаАвансРаботникиОрганизации.Авторасчет
	|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса / 100 * &парамПроцентВыплаты
	|		ИНАЧЕ СписокНаАвансРаботникиОрганизации.Сумма
	|	КОНЕЦ КАК Сумма,
	|	СписокНаАвансРаботникиОрганизации.Авторасчет
	|ИЗ
	|	Документ.СписокНаАванс.РаботникиОрганизации КАК СписокНаАвансРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамДата, ) КАК АвансыРаботникамОрганизацийСрезПоследних
	|		ПО СписокНаАвансРаботникиОрганизации.Физлицо = АвансыРаботникамОрганизацийСрезПоследних.Физлицо
	|			И (АвансыРаботникамОрганизацийСрезПоследних.Организация = &парамОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
	|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
	|		ПО СписокНаАвансРаботникиОрганизации.Физлицо = Основные.ФизЛицо
	|ГДЕ
	|	СписокНаАвансРаботникиОрганизации.Ссылка = &парамСсылка
	|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокНаАвансРаботникиОрганизации.НомерСтроки";
	
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	РаботникиОрганизации.Свернуть("ФизЛицо","Сумма");
КонецПроцедуры

// Рассчитывает "усредненную" 1/300 часть ставки рефинансирования ЦБ
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   число - коэффициент, на который следует умножать сумму выплаты
//
Функция РассчитатьПроцентКомпенсации() Экспорт
	
	//Если ДнейНеВыплаты = 0 Тогда
	//	Возврат 0
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РАЗНОСТЬДАТ(ПериодыИзмененияСтавки.ДатаC, ПериодыИзмененияСтавки.ДатаПо, ДЕНЬ) * ПериодыИзмененияСтавки.Размер / 300 / 100), 0) КАК ПроцентКомпенсации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА СтавкаРефинансированияЦБ.Период > &ДатаВыплаты
	|				ТОГДА СтавкаРефинансированияЦБ.Период
	|			ИНАЧЕ &ДатаВыплаты
	|		КОНЕЦ КАК ДатаC,
	|		ЕСТЬNULL(ВЫБОР
	|				КОГДА МИНИМУМ(СледующаяДата.Период) >= &ДатаДокумента
	|					ТОГДА &ДатаДокумента
	|				ИНАЧЕ МИНИМУМ(СледующаяДата.Период)
	|			КОНЕЦ, &ДатаДокумента) КАК ДатаПо,
	|		СтавкаРефинансированияЦБ.Размер КАК Размер
	|	ИЗ
	|		РегистрСведений.СтавкаРефинансированияЦБ КАК СтавкаРефинансированияЦБ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкаРефинансированияЦБ КАК СледующаяДата
	|			ПО СтавкаРефинансированияЦБ.Период < СледующаяДата.Период
	|	ГДЕ
	|		СтавкаРефинансированияЦБ.Период <= &ДатаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтавкаРефинансированияЦБ.Размер,
	|		СтавкаРефинансированияЦБ.Период
	|	
	|	ИМЕЮЩИЕ
	|		ЕСТЬNULL(МИНИМУМ(СледующаяДата.Период), &ДатаДокумента) >= &ДатаВыплаты) КАК ПериодыИзмененияСтавки";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	//Запрос.УстановитьПараметр("ДатаВыплаты", Дата - 86400 * ДнейНеВыплаты);
	Запрос.УстановитьПараметр("ДатаВыплаты", Дата);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить()[0].ПроцентКомпенсации
	
КонецФункции // РассчитатьПроцентКомпенсации()

Процедура РасчетТарифногоОклада() Экспорт
	Перем ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга;
	
	Если Не Организация.ИНН ="100765738"  Тогда
		Возврат
	КонецЕсли; 
	
	ПовышениеТК = Истина;
	Доплаты  = Истина;  
	Надбавки  = Истина;      
	НачДата = ПериодРегистрации;//Дата;
	ПоПодразделениям = Ложь;	
	Подразделение  = ПодразделениеОрганизации;
	
	СписокПовышения = новый СписокЗначений;
	СписокНадбавки = новый СписокЗначений;
	СписокДоплаты = новый СписокЗначений;
	ТаблицаПовышения = новый ТаблицаЗначений;
	ТаблицаНадбавки = новый ТаблицаЗначений;
	ТаблицаДоплаты = новый ТаблицаЗначений;
	ТаблицаПовышения.Колонки.Добавить("ВидРасчета");
	ТаблицаПовышения.Колонки.Добавить("Коэф");
	ТаблицаПовышения.Колонки.Добавить("Сумма");
	ТаблицаНадбавки.Колонки.Добавить("ВидРасчета");
	ТаблицаНадбавки.Колонки.Добавить("Коэф");
	ТаблицаНадбавки.Колонки.Добавить("Сумма");
	ТаблицаДоплаты.Колонки.Добавить("ВидРасчета");
	ТаблицаДоплаты.Колонки.Добавить("Коэф");
	ТаблицаДоплаты.Колонки.Добавить("Сумма");
	Выборка = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Повышения Тогда
			СписокПовышения.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаПовышения.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Надбавки Тогда 
			СписокНадбавки.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаНадбавки.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Доплаты Тогда 
			СписокДоплаты.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаДоплаты.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	Выборка = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Повышения Тогда
			СписокПовышения.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаПовышения.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Надбавки Тогда 
			СписокНадбавки.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаНадбавки.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Доплаты Тогда 
			СписокДоплаты.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаДоплаты.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПовышенияИтог = ТаблицаПовышения.Скопировать(,"ВидРасчета,Сумма");
	ТаблицаНадбавкиИтог = ТаблицаНадбавки.Скопировать(,"ВидРасчета,Сумма");
	ТаблицаДоплатыИтог = ТаблицаДоплаты.Скопировать(,"ВидРасчета,Сумма");
	
	ТаблицаПовышенияИтог.ЗаполнитьЗначения(0,"Сумма");
	ТаблицаНадбавкиИтог.ЗаполнитьЗначения(0,"Сумма");
	ТаблицаДоплатыИтог.ЗаполнитьЗначения(0,"Сумма");
	
	ТарифныйОкладОбщая = 0;
	ДолжностнойОкладОбщая = 0;
	МесОкладОбщая = 0;
	ТекущаяПремияОбщая = 0;
	ИтогоОбщая = 0;
	
	ПодразделениеСтарое = "";
	ЗапросНеВход = Новый Запрос;
	ЗапросНеВход.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК Подразделение,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.КоэффициентЕТС, 1) КАК КоэффициентЕТС,
	|	РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
	|	РаботникиОрганизацийСрезПоследних.Категория,
	|	РаботникиОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
	|	ДопФизЛица.Специальность,
	|	ДопФизЛица.ВидСтажа,
	|	ДопФизЛица.ДатаОтсчета,
	|	РаботникиОрганизацийСрезПоследних.РазрядЕТС,
	|	ВЫБОР
	|		КОГДА Коэффициенты.Коэффициент = 0
	|				ИЛИ Коэффициенты.Коэффициент = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КорректКоэффициент.Размер = 0
	|				ИЛИ Коэффициенты.КорректКоэффициент.Размер = NULL
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(Коэффициенты.КорректКоэффициент.Размер, 1)
	|	КОНЕЦ КАК КорректКоэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.ПовышКоэффициент = 0
	|				ИЛИ Коэффициенты.ПовышКоэффициент = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.ПовышКоэффициент
	|	КОНЕЦ КАК ПовышКоэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентСложность = 0
	|				ИЛИ Коэффициенты.КоэффициентСложность = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.КоэффициентСложность
	|	КОНЕЦ КАК КоэффициентСложность,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентТехнологОперации = 0
	|				ИЛИ Коэффициенты.КоэффициентТехнологОперации = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.КоэффициентТехнологОперации
	|	КОНЕЦ КАК КоэффициентТехнологОперации,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабНомер,
	|	ДопФизЛица.РазмерМесяцев,
	|	ДопФизЛица.РазмерДней,
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок,
	|	ДопФизЛица.ВидСтажа1,
	|	ДопФизЛица.ДатаОтсчета1,
	|	ДопФизЛица.РазмерМесяцев1,
	|	ДопФизЛица.РазмерДней1,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник.Физлицо в (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ФизическиеЛицаОбразование.Специальность КАК Специальность,
	|			NULL КАК ВидСтажа,
	|			NULL КАК ДатаОтсчета,
	|			ФизическиеЛицаОбразование.Ссылка КАК Ссылка,
	|			NULL КАК РазмерМесяцев,
	|			NULL КАК РазмерДней,
	|			NULL КАК РазмерМесяцев1,
	|			NULL КАК РазмерДней1,
	|			NULL КАК ВидСтажа1,
	|			NULL КАК ДатаОтсчета1
	|		ИЗ
	|			Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			NULL,
	|			ФизическиеЛицаСтажи.ВидСтажа,
	|			ФизическиеЛицаСтажи.ДатаОтсчета,
	|			ФизическиеЛицаСтажи.Ссылка,
	|			ФизическиеЛицаСтажи.РазмерМесяцев,
	|			ФизическиеЛицаСтажи.РазмерДней,
	|			ВложенныйЗапрос.РазмерМесяцев1,
	|			ВложенныйЗапрос.РазмерДней1,
	|			ВложенныйЗапрос.ВидСтажа1,
	|			ВложенныйЗапрос.ДатаОтсчета1
	|		ИЗ
	|			Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
	|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ФизическиеЛицаСтажи.ВидСтажа КАК ВидСтажа1,
	|					ФизическиеЛицаСтажи.ДатаОтсчета КАК ДатаОтсчета1,
	|					ФизическиеЛицаСтажи.РазмерМесяцев КАК РазмерМесяцев1,
	|					ФизическиеЛицаСтажи.РазмерДней КАК РазмерДней1,
	|					ФизическиеЛицаСтажи.Ссылка КАК Ссылка
	|				ИЗ
	|					Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
	|				ГДЕ
	|					ФизическиеЛицаСтажи.ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.СтажВОтрасли)) КАК ВложенныйЗапрос
	|				ПО ФизическиеЛицаСтажи.Ссылка = ВложенныйЗапрос.Ссылка
	|		ГДЕ
	|			ФизическиеЛицаСтажи.ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.НепрерывныйСтаж)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФизическиеЛицаСтажи.Ссылка,
	|			ФизическиеЛицаСтажи.ВидСтажа,
	|			ФизическиеЛицаСтажи.ДатаОтсчета,
	|			ФизическиеЛицаСтажи.РазмерМесяцев,
	|			ФизическиеЛицаСтажи.РазмерДней,
	|			ВложенныйЗапрос.РазмерМесяцев1,
	|			ВложенныйЗапрос.РазмерДней1,
	|			ВложенныйЗапрос.ВидСтажа1,
	|			ВложенныйЗапрос.ДатаОтсчета1) КАК ДопФизЛица
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ДопФизЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Ссылка КАК Ссылка,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Коэффициент КАК Коэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КорректКоэффициент КАК КорректКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.ПовышКоэффициент КАК ПовышКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентСложность КАК КоэффициентСложность,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентТехнологОперации КАК КоэффициентТехнологОперации
	|		ИЗ
	|			Справочник.ЕдинаяТарифнаяСеткаРБ.Коэффициенты КАК ЕдинаяТарифнаяСеткаРБКоэффициенты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Ссылка,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Коэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КорректКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.ПовышКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентСложность,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентТехнологОперации) КАК Коэффициенты
	|		ПО РаботникиОрганизацийСрезПоследних.Должность.СтрокаЕТС = Коэффициенты.Ссылка
	|	ГДЕ
	|	Выбор
	|Когда РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
	|Тогда Ложь Иначе Истина Конец
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	|   //И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|	//И РаботникиОрганизацийСрезПоследних.Сотрудник.Код МЕЖДУ &ТабНач И &ТабКон
	|
	|УПОРЯДОЧИТЬ ПО
	|//	ПодразделениеОрганизацииНаименование,
	|	ТабельныйНомер
	|ИТОГИ
	|	СУММА(КоэффициентЕТС),
	|	СУММА(ПовышенныйКоэффициентЕТС),
	|	СУММА(Коэффициент),
	|	СУММА(КорректКоэффициент),
	|	СУММА(ПовышКоэффициент),
	|	СУММА(КоэффициентСложность),
	|	СУММА(КоэффициентТехнологОперации)
	|ПО
	|	ОБЩИЕ";
	
	
	ЗапросНеВход.УстановитьПараметр("Организация", Организация);
	ЗапросНеВход.УстановитьПараметр("Дата", НачДата);
	//
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Авторасчет", Истина);
	Зарплата_ = РаботникиОрганизации.НайтиСтроки(ПараметрыОтбора);
	МассивФизлицо = Новый Массив;
	Для каждого СтрЗарплата_ Из Зарплата_ Цикл
		МассивФизлицо.Добавить(СтрЗарплата_.Физлицо);
	КонецЦикла; 
	ЗапросНеВход.УстановитьПараметр("СписокСотрудников",МассивФизлицо );
	//
	ЗапросНеВход.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Если ЗначениеЗаполнено(Подразделение) или ПоПодразделениям Тогда
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//	ПодразделениеОрганизацииНаименование,","ПодразделениеОрганизацииНаименование,");
	иначе
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//	ПодразделениеОрганизацииНаименование,","");
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Подразделение) Тогда 
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
	Иначе 
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.Сотрудник.Код МЕЖДУ &ТабНач И &ТабКон","");
		
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации","И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации");
	КонецЕсли;
	
	
	РезОбщий = ЗапросНеВход.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РегистраторВыбытие = Новый СписокЗначений;
	
	результат=0; 	
	
	//#
	РазмерБазовойВеличины = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина)).Размер;
	если ЗначениеЗаполнено(Подразделение) Тогда
		ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("Организация,ТарифнаяСтавка",Подразделение.Владелец,Справочники.ТарифныеСтавкиПервогоРазряда.Основная)).Размер;
	иначе
		ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("ТарифнаяСтавка",Справочники.ТарифныеСтавкиПервогоРазряда.Основная)).Размер;
	КонецЕсли;
	Ном = 14; 
	Н=17;
	
	ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(НачДата).Размер;
	РезОбщий.Следующий();
	РезНеВх = РезОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока РезНеВх.Следующий() Цикл 
		если РезНеВх.Сотрудник = Null Тогда 
			Продолжить;
		КонецЕсли;
		ЛетСтажа = 0;
		если РезНеВх.ВидСтажа = Справочники.ВидыСтажа.НепрерывныйСтаж Тогда 
			ДатаОтсчета = ДобавитьМесяц (РезНеВх.ДатаОтсчета,-РезНеВх.РазмерМесяцев)-РезНеВх.РазмерДней *24*60*60;
			ДатаВыслуги =НачДата;
			ОбщегоНазначения.РазобратьРазностьДат(ДатаВыслуги,ДатаОтсчета,ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга);
			ЛетСтажа = ГодВыслуга;
		КонецЕсли;
		ЛетСтажа1 = 0;
		Если РезНеВх.ВидСтажа1 = Справочники.ВидыСтажа.СтажВОтрасли Тогда
			ДатаОтсчета = ДобавитьМесяц (РезНеВх.ДатаОтсчета1,-РезНеВх.РазмерМесяцев1)-РезНеВх.РазмерДней1 *24*60*60;
			ДатаВыслуги = НачДата;
			ОбщегоНазначения.РазобратьРазностьДат(ДатаВыслуги,ДатаОтсчета,ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга);
			ЛетСтажа1 = ГодВыслуга;
		КонецЕсли;
		
		ПечОбъемРаботыПоДолжности = РезНеВх.ЗанимаемыхСтавок;
		
		Заполнить(РезНеВх);
		Если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда
			Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(РезНеВх.Сотрудник.Наименование);
		Иначе
			Сотрудник = "ВАКАНСИЯ";
		КонецЕсли;
		
		ТарифныйОклад = ОбщегоНазначения.ОкруглитьЗначение2016(?(не (ТарифнаяСтавка1Разряда=null или ТарифнаяСтавка1Разряда=0) ,ТарифнаяСтавка1Разряда,1)*?(не (РезНеВх.Коэффициент=null или  РезНеВх.Коэффициент=0),РезНеВх.Коэффициент,1) * ?(не (РезНеВх.КорректКоэффициент=null или РезНеВх.КорректКоэффициент=0) ,РезНеВх.КорректКоэффициент,1)
		* ?(не( РезНеВх.ПовышКоэффициент=null или  РезНеВх.ПовышКоэффициент=0) ,РезНеВх.ПовышКоэффициент,1) * ?(не (РезНеВх.КоэффициентСложность=null или РезНеВх.КоэффициентСложность=0),РезНеВх.КоэффициентСложность,1) * ?(не (РезНеВх.КоэффициентТехнологОперации=null или РезНеВх.КоэффициентТехнологОперации=0),РезНеВх.КоэффициентТехнологОперации,1)*ПечОбъемРаботыПоДолжности,НачДата);//О.Т. Аверсон 14.03.2016 № 949
		ТарифныйОкладОбщая = ТарифныйОкладОбщая+ТарифныйОклад;
		
		Заполнить(РезНеВх);
		Заполнить(РезНеВх);
		
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.Текст = 
		"ВЫБРАТЬ
		|	&парамНачало КАК Период,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОсновноеНачисление,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|						ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|					ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|				КОНЕЦ
		|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|	КОНЕЦ КАК Действие,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель1Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель2Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель3Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель4Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель5Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель6Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|	КОНЕЦ КАК Показатель6,
		|	НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
		|	НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&парамНачало,
		|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И Сотрудник В (&Сотрудник)
		|				И Организация В (&Организация)) КАК НачисленияРаботниковОрганизации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И НачисленияРаботниковОрганизации.ВидРасчета В(&ВидРасчета)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидРасчета";
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокПовышения);
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		ОбщаяСумма = 0;
		ОбщаяСуммаДоплНадбавка = 0;
		ВидСтажа = 0;
		
		ЭтоПовышения=Истина;
		ЭтоНадбавка=Ложь;
		
		ТаблицаПовышения.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаПовышения.ЗаполнитьЗначения(0,"Сумма");
		
		КоэффициентПовыш = 0;
		СуммаПовыш=0;
		БылВТО = Ложь;
		
		пока РезНачисления.Следующий() Цикл 
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Стаж по специальности (отрасли)") Тогда
				КоэфПоказатель1 = 0;
				если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда 
					КоэффициентСтажа = РезНачисления.ВидРасчета.КоэффициентСтажа.ССылка;
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ШкалаКоэффициентовСтажа.Величина
					|ИЗ
					|	РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
					|ГДЕ
					|	ШкалаКоэффициентовСтажа.КоэффициентСтажа.Ссылка = &КоэффициентСтажа
					|	И ШкалаКоэффициентовСтажа.СтажС <= &Стаж
					|	И ШкалаКоэффициентовСтажа.СтажПо > &Стаж";
					
					Запрос.УстановитьПараметр("Стаж", ЛетСтажа1);
					Запрос.УстановитьПараметр("КоэффициентСтажа", КоэффициентСтажа);
					
					РезультатСтаж = Запрос.Выполнить().Выбрать();
					Пока РезультатСтаж.Следующий() Цикл
						КоэфПоказатель1 = РезультатСтаж.Величина;
					КонецЦикла;
				КонецЕсли;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
			Иначе
				КоэфПоказатель1 = РезНачисления.Показатель1;	
				Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Вредность") Тогда
					СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(РезНеВх.ЗанимаемыхСтавок*ТарифнаяСтавка1Разряда* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
				Иначе
					Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышающий коэфф") Тогда	
						Если Не БылВТО Тогда
							СуммаПовыш=ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);
						Иначе
							КоэфПоказатель1=0;
						КонецЕсли;
					ИначеЕсли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышение ВТО") Тогда		
						Если КоэфПоказатель1 > 40 Тогда
							БылВТО = ИСТИНА;
						КонецЕсли;
					КонецЕсли;
					СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
				КонецЕсли;	
			КонецЕсли;
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если ПовышениеТК Тогда
				НайденнаяСтрока = ТаблицаПовышения.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаПовышенияИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если БылВТО и Не СуммаПовыш = 0 Тогда
			ВидРасчетаПовыш = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышающий коэфф");
			НайденныйРасчетПовыш = СписокПовышения.НайтиПоЗначению(ВидРасчетаПовыш);
			Если Не НайденныйРасчетПовыш = Неопределено Тогда
				ОбщаяСумма = ОбщаяСумма - СуммаПовыш;
				если ПовышениеТК Тогда
					НайденнаяСтрока = ТаблицаПовышения.Найти(ВидРасчетаПовыш,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = 0;
						НайденнаяСтрока.Сумма = 0;
					КонецЕсли;
					НайденнаяСтрока1 = ТаблицаПовышенияИтог.Найти(ВидРасчетаПовыш,"ВидРасчета");
					Если не НайденнаяСтрока1 = Неопределено Тогда
						НайденнаяСтрока1.Сумма = НайденнаяСтрока1.Сумма - СуммаПовыш;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" и ЭтоПовышения и Не ЭтоНадбавка Тогда 
			ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Стаж по специальности (отрасли)");
			НайденныйРасчет = СписокПовышения.НайтиПоЗначению(ВидРасчета);
			Если Не НайденныйРасчет = Неопределено Тогда
				КоэфПоказатель1 = 20;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
				ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
				если ПовышениеТК Тогда
					НайденнаяСтрока = ТаблицаПовышения.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = КоэфПоказатель1;
						НайденнаяСтрока.Сумма = СуммаОтПроцента;
					КонецЕсли;
					НайденнаяСтрока1 = ТаблицаПовышенияИтог.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока1 = Неопределено Тогда
						НайденнаяСтрока1.Сумма = НайденнаяСтрока1.Сумма + СуммаОтПроцента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		ДолжностнойОклад = ТарифныйОклад+ОбщаяСумма;
		ДолжностнойОкладОбщая = ДолжностнойОкладОбщая + ДолжностнойОклад;
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокДоплаты);
		ОбщаяСумма = 0;
		
		ЗапросВремя = Новый Запрос;
		ЗапросВремя.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата1, ) КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВложенныйЗапрос.ГрафикРаботы)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
		
		ЗапросВремя.УстановитьПараметр("Дата1",НачДата);
		ЗапросВремя.УстановитьПараметр("Дата2",КонецМесяца(НачДата));
		ЗапросВремя.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		
		ТаблицаДоплаты.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаДоплаты.ЗаполнитьЗначения(0,"Сумма");
		
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		пока РезНачисления.Следующий() Цикл
			КоэфПоказатель1 = РезНачисления.Показатель1;
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Доплата за вредность") Тогда 
				РабочихЧасов = 0;
				РезВремя = ЗапросВремя.Выполнить().Выбрать();
				Пока РезВремя.Следующий() Цикл
					РабочихЧасов = РезВремя.ОсновноеЗначениеНорма;
				КонецЦикла;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифнаяСтавка1Разряда* КоэфПоказатель1*РабочихЧасов/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
			Иначе	
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т.  949
			КонецЕсли;
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если Доплаты Тогда
				НайденнаяСтрока = ТаблицаДоплаты.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаДоплатыИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;			
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокНадбавки);
		
		ТаблицаНадбавки.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаНадбавки.ЗаполнитьЗначения(0,"Сумма");
		
		ЭтоПовышения = Ложь;
		ЭтоНадбавка = Истина;
		
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		пока РезНачисления.Следующий() Цикл
			КоэфПоказатель1 = РезНачисления.Показатель1;
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("ПАЛ; ЦВВК") Тогда  // замена наименования ПАЛ; СМЛ
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(РезНеВх.ЗанимаемыхСтавок * ТарифнаяСтавка1Разряда* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
			Иначеесли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Выслуга") Тогда 
				КоэфПоказатель1 = 0;
				если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда
					КоэффициентСтажа = РезНачисления.ВидРасчета.КоэффициентСтажа.ССылка;
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ШкалаКоэффициентовСтажа.Величина
					|ИЗ
					|	РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
					|ГДЕ
					|	ШкалаКоэффициентовСтажа.КоэффициентСтажа.Ссылка = &КоэффициентСтажа
					|	И ШкалаКоэффициентовСтажа.СтажС <= &Стаж
					|	И ШкалаКоэффициентовСтажа.СтажПо > &Стаж";
					
					Запрос.УстановитьПараметр("Стаж", ЛетСтажа);
					Запрос.УстановитьПараметр("КоэффициентСтажа", КоэффициентСтажа);
					
					РезультатСтаж = Запрос.Выполнить().Выбрать();
					Пока РезультатСтаж.Следующий() Цикл
						КоэфПоказатель1 = РезультатСтаж.Величина;
					КонецЦикла;
				КонецЕсли;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад* КоэфПоказатель1/100,НачДата); //О.Т.
			Иначеесли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Надбавка") Тогда //О.Т. Аверсон 03.05.2017 № 555
				СуммаОтПроцента = 0;	
			Иначе	
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т.
			КонецЕсли;	
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если Надбавки Тогда
				НайденнаяСтрока = ТаблицаНадбавки.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаНадбавкиИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1"  и Не ЭтоПовышения и ЭтоНадбавка Тогда 
			ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Выслуга");
			НайденныйРасчет = СписокНадбавки.НайтиПоЗначению(ВидРасчета);
			Если Не НайденныйРасчет = Неопределено Тогда
				КоэфПоказатель1 = 15;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
				ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
				если Надбавки Тогда
					НайденнаяСтрока = ТаблицаНадбавки.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = КоэфПоказатель1;
						НайденнаяСтрока.Сумма = СуммаОтПроцента;
					КонецЕсли;
					НайденнаяСтрока = ТаблицаНадбавкиИтог.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		
		МесячныйФондЗП = ДолжностнойОклад + ОбщаяСумма; 
		МесОкладОбщая = МесОкладОбщая+МесячныйФондЗП;
		
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда 
			КоэфПремия = 60;
		иначе
			КоэфПремия = 0;
			ПремияОсновная = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Премия"); 
			ЗапросНачисления.УстановитьПараметр("Организация",Организация);
			ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
			ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
			ЗапросНачисления.УстановитьПараметр("ВидРасчета",ПремияОсновная);
			РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
			пока РезНачисления.Следующий() Цикл
				КоэфПремия = РезНачисления.Показатель1;
			КонецЦикла;
		КонецЕсли;
		КоэфПремия = КоэфПремия;
		Премия = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад *КоэфПремия/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949 
		ТекущаяПремияОбщая = ТекущаяПремияОбщая+Премия;
		ИтогоСтрока =МесячныйФондЗП+Премия; 
		//---------------------- Запись в регистр МесячныйФондРаботниковОрганизации --------------------
		Регистр =РегистрыСведений.МесячныйФондРаботниковОрганизации.СоздатьНаборЗаписей();
		Регистр.Отбор.Период.Установить(НачалоМесяца(НачДата));
		Регистр.Отбор.Сотрудник.Установить(РезНеВх.Сотрудник);
		Регистр.Отбор.Организация.Установить(Организация);
		Регистр.Прочитать();
		если Регистр.Количество()>0 Тогда 
			если Регистр[0].МесячныйФонд <> ИтогоСтрока Тогда 
				Регистр[0].МесячныйФонд 	= ИтогоСтрока;
				Регистр[0].ТарифныйОклад 	= ТарифныйОклад;
				Регистр[0].Оклад 			= ДолжностнойОклад;
				Если Регистр.Количество() > 0 И ЗначениеЗаполнено(Регистр[0].Период) Тогда
					Регистр[0].Сотрудник = РезНеВх.Сотрудник;
					Регистр.Отбор.Сотрудник.Использование	= Истина;
					Регистр.Отбор.Сотрудник.Значение			= Регистр[0].Сотрудник;
					Регистр.Отбор.Период.Использование		= Истина;
					Регистр.Отбор.Период.Значение			= Регистр[0].Период;
					Регистр.Отбор.Организация.Использование		= Истина;
					Регистр.Отбор.Организация.Значение			= Регистр[0].Организация;
					Регистр.Записать(Истина);
				КонецЕсли;
			КонецЕсли;
		иначе
			ЗаписьНабора = Регистр.Добавить();
			ЗаписьНабора.Период 							= НачалоМесяца(НачДата);
			ЗаписьНабора.Организация                        = Организация;
			ЗаписьНабора.Сотрудник 							= РезНеВх.Сотрудник;
			ЗаписьНабора.МесячныйФонд                       = ИтогоСтрока;
			ЗаписьНабора.ТарифныйОклад                      = ТарифныйОклад;
			ЗаписьНабора.Оклад                      		= ДолжностнойОклад;
			Если Регистр.Количество() > 0 И ЗначениеЗаполнено(Регистр[0].Период) Тогда
				Регистр[0].Сотрудник = РезНеВх.Сотрудник;
				Регистр.Отбор.Сотрудник.Использование	= Истина;
				Регистр.Отбор.Сотрудник.Значение			= Регистр[0].Сотрудник;
				Регистр.Отбор.Период.Использование		= Истина;
				Регистр.Отбор.Период.Значение			= Регистр[0].Период;
				Регистр.Отбор.Организация.Использование		= Истина;
				Регистр.Отбор.Организация.Значение			= Регистр[0].Организация;
				Регистр.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
		//------------------------------------------------------------------ конец записи в регистр
		ИтогоОбщая = ИтогоОбщая+ИтогоСтрока;
		ПодразделениеСтарое = РезНеВх.Подразделение;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьЗаписиРССписокНаАванс();
КонецПроцедуры

Процедура СформироватьЗаписиРССписокНаАванс()

	Набор = РегистрыСведений.СписокНаАванс.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого Стр Из РаботникиОрганизации Цикл
		Запись = Набор.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Период = НачалоМесяца(Дата);
		Запись.ФизЛицо = Стр.ФизЛицо;
		Запись.Сумма = Стр.Сумма;
	КонецЦикла;
	Набор.Записать();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"Физлицо");
КонецПроцедуры
